ezois_ka/oooezoiskaobmen/src/DataProcessors/ЗаменаСтавокНДС/ЗаменаСтавокНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаменаСтавокНДС</name>
</mdclass:DataProcessor>

ezois_ka/oooezoiskaobmen/src/Documents/ИзменениеУсловийДоговораАренды/ИзменениеУсловийДоговораАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеУсловийДоговораАренды</name>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСУУ</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>InformationRegister.УсловияДоговоровАренды</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииОСБУ</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>InformationRegister.ГрафикНачисленияУслугПоАренде</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.АрендованныеОС</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.АмортизацияОС</registerRecords>
  <registerRecords>InformationRegister.ГрафикОплатУслугПоАренде</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоФинансовымИнструментам</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюДокументовИмпорта</registerRecords>
  <registerRecords>InformationRegister.ГрафикНачисленияПроцентовПоАренде</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЛет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокМес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриведеннаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПредметовАренды</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбеспечительногоПлатежа</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУслугПоАренде</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВыкупаПредметовАренды</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСВыкупаПредметовАренды</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПроцентов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОплат</name>
    <type>
      <types>EnumRef.ПериодичностьГрафика</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьНачислений</name>
    <type>
      <types>EnumRef.ПериодичностьГрафика</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаУслугиПоАренде</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислениеУслугиПоАренде</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАренды</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервогоОбеспечительногоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыкупа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивовРасходы</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСчетовУчетаРасходы</name>
    <type>
      <types>CatalogRef.НастройкиСчетовУчетаПрочихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикНачисленияПроцентовВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйПартнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущиеУсловияАренды</name>
    <type>
      <types>DocumentRef.ВводОстатковВзаиморасчетовПоАренде</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ИзменениеУсловийДоговораАренды</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
      <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
      <types>DocumentRef.ЗаключениеДоговораАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>СправедливаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НегарантированнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБУ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьНУ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьУУ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияУУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеСПредметомАренды</name>
      <type>
        <types>EnumRef.ДействияСПредметамиАренды</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыкупнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Субаренда</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикОплатУслуг</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УслугаПоАренде</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УслугаПоАрендеНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбеспечительныйПлатеж</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбеспечительныйПлатежНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыкупнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыкупнаяСтоимостьНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикНачисленияУслуг</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УслугаПоАренде</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УслугаПоАрендеНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбеспечительныйПлатеж</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбеспечительныйПлатежНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикНачисленияПроцентов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проценты</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/DataProcessors/ЗаменаСтавокНДС/Forms/ФормаОбработки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(СтранаРегистрации) Тогда
		СтранаРегистрации = Константы.ОсновнаяСтрана.Получить();
	КонецЕсли;
	
	ЭтоУТ = ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
	Элементы.ГруппаДоговорыАренды.Видимость = Не ЭтоУТ;
	Элементы.ПерейтиДокументы.Видимость     = Не ЭтоУТ;
	Элементы.ПредупреждениеАренда.Видимость = Не ЭтоУТ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Не ЗначениеЗаполнено(СтранаРегистрации) Тогда
		СтранаРегистрации = Константы.ОсновнаяСтрана.Получить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекущаяСтавкаПриИзменении(Элемент)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаРегистрацииПриИзменении(Элемент)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНоменклатураОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтавкаНДС = ДанныеНоменклатураОбработкаНавигационнойСсылкиНаСервере(НавигационнаяСсылкаФорматированнойСтроки);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Страна",    СтранаРегистрации);
	ПараметрыФормы.Вставить("СтавкаНДС", СтавкаНДС);
	ПараметрыФормы.Вставить("Период",    Период);
	
	ОткрытьФорму("РегистрСведений.СтавкиНДСНоменклатуры.Форма.РабочееМесто", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВидыНоменклатурыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСправочника(НавигационнаяСсылкаФорматированнойСтроки, "Справочник.ВидыНоменклатуры.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДоговорыКонтрагентовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСправочника(НавигационнаяСсылкаФорматированнойСтроки, "Справочник.ДоговорыКонтрагентов.Форма.ФормаСписка", Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДанныеДоговорыМеждуорганизациямиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСправочника(НавигационнаяСсылкаФорматированнойСтроки, "Справочник.ДоговорыМеждуОрганизациями.Форма.ФормаСписка", Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДанныеДоговорыАрендыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСправочникаДоговорыАренды(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВезде(Команда)
	
	Если Не ПроверитьЗаполнениеФормы(Истина) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("Номенклатура");
	СписокСправочников.Добавить("ВидыНоменклатуры");
	СписокСправочников.Добавить("ДоговорыКонтрагентов");
	СписокСправочников.Добавить("ДоговорыМеждуОрганизациями");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВВидеНоменклатуры(Команда)
	
	Если Не ПроверитьЗаполнениеФормы(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("ВидыНоменклатуры");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВНоменклатуре(Команда)
	
	Если Не ПроверитьЗаполнениеФормы(Истина) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("Номенклатура");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаменитьВДоговорахСКонтрагентами(Команда) 
	
	Если Не ПроверитьЗаполнениеФормы(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("ДоговорыКонтрагентов");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВДоговорахМеждуОрганизациями(Команда)
	
	Если Не ПроверитьЗаполнениеФормы(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("ДоговорыМеждуОрганизациями");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДоговорыАренды(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Документ.ИзменениеУсловийДоговораАренды.Форма.ФормаСписка");
	//-- НЕ УТ
	
	Возврат ; // В УТ не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДокументы(Команда)
	
	//++ НЕ УТ
	ОткрытьФорму("Документ.ИзменениеУсловийПередачиВАренду.Форма.ФормаСписка");
	//-- НЕ УТ
	
	Возврат ; // В УТ не используется
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьОбновлениеФормы()

	ДлительнаяОперация = НачатьОбновлениеФормыНаСервере();

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеФормыЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеФормыНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ПараметрыПолученияДанных = Обработки.ЗаменаСтавокНДС.ПараметрыПолученияДанных();
	ПараметрыПолученияДанных.ТекущаяСтавка = ТекущаяСтавка;
	ПараметрыПолученияДанных.НоваяСтавка   = НоваяСтавка;
	ПараметрыПолученияДанных.Период        = Период;
	ПараметрыПолученияДанных.Страна        = СтранаРегистрации;
	
	ИмяФункции = "Обработки.ЗаменаСтавокНДС.ПолучениеДанныхПоСтавкахНДС";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		ИмяФункции, ПараметрыПолученияДанных);
	
КонецФункции

&НаКлиенте
Процедура ОбновлениеФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ДанныеСправочниковПоСтавкам = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	СтрокаШаблона             = НСтр("ru = '%4 %1 - <a href = ""%2""> %3 </a>'");
	СтрокаШаблонаПервойСтроки = НСтр("ru = '%1 - <a href = ""%2""> %3 </a>'");
	Разделитель = ","; 
	ВыводитьКнопкуИзменитьВсе = Ложь;
	
	Для Каждого ТипСправочника Из ДанныеСправочниковПоСтавкам Цикл
		
		ИмяЭлементаУспешно = "Успешно" + ТипСправочника.Ключ;
		ЭтотОбъект[ИмяЭлементаУспешно] = Истина;
		ИмяЭлемента = "Группа"+ТипСправочника.Ключ;
		Массив = Новый Массив();
		
		Если ЗначениеЗаполнено(ТипСправочника.Значение) Тогда
			
			Элементы[ИмяЭлемента].Видимость = Истина;
			ВыводитьКнопкуИзменитьВсе = Истина;
			ПерваяСтрока = Истина;
			Для Каждого СтавкаНДС Из ТипСправочника.Значение Цикл
				Если ЗначениеЗаполнено(СтавкаНДС.СтавкаНДС) Тогда
					Если СтавкаНДС.СтавкаНДС = ТекущаяСтавка Тогда
						
						ЭтотОбъект[ИмяЭлементаУспешно] = Ложь;
						Если Не ТипСправочника.Ключ = "ДоговорыАренды" Тогда
							ИмяЭлемента = "Заменить"+ТипСправочника.Ключ;
							Элементы[ИмяЭлемента].Заголовок = НСтр("ru = 'Заменить ставку'") + " (" + СтавкаНДС.Количество+")";
						КонецЕсли;
						
					КонецЕсли;
					СтрокаСДаннымиПоставке = СтроковыеФункцииКлиент.ФорматированнаяСтрока(?(ПерваяСтрока, СтрокаШаблонаПервойСтроки, СтрокаШаблона),
																		Строка(СтавкаНДС.СтавкаНДС), СтавкаНДС.УИД, СтавкаНДС.Количество, Разделитель);
					
					Массив.Добавить(СтрокаСДаннымиПоставке);
					ИмяЭлемента = "Данные"+ТипСправочника.Ключ;
					Элементы[ИмяЭлемента].Заголовок = Новый ФорматированнаяСтрока(Массив);
					ПерваяСтрока = Ложь;
					
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Элементы[ИмяЭлемента].Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ФормаЗаменитьВезде.Доступность = ВыводитьКнопкуИзменитьВсе;
	УстановитьВидимость(ДанныеСправочниковПоСтавкам);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаСтавкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеНоменклатураОбработкаНавигационнойСсылкиНаСервере(УИД)
	
	Возврат Справочники.СтавкиНДС.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	
КонецФункции

&НаСервере
Процедура УстановитьВидимость(АнализируемыеСправочники)
	
	Для Каждого Справочник Из АнализируемыеСправочники Цикл
		ИмяЭлементаУспешно = "Успешно" + Справочник.Ключ;
		Элементы["ДекорацияЗаменаСтавок" + Справочник.Ключ].Видимость = Не ЭтотОбъект[ИмяЭлементаУспешно];
		Элементы["ДекорацияЗаменаСтавокУспешно" + Справочник.Ключ].Видимость = ЭтотОбъект[ИмяЭлементаУспешно];
		Если Справочник.Ключ <> "ДоговорыАренды" Тогда
			Элементы["Заменить" + Справочник.Ключ].Доступность = Не ЭтотОбъект[ИмяЭлементаУспешно];
			Если ЭтотОбъект[ИмяЭлементаУспешно] Тогда
				ИмяЭлемента = "Заменить"+Справочник.Ключ;
				Элементы[ИмяЭлемента].Заголовок = НСтр("ru = 'Заменить ставку'") + " (" + 0 +")";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСправочника(УИД, ИмяФормы, ОтборПоПериоду = Ложь)
	
	СтавкаНДС = ДанныеНоменклатураОбработкаНавигационнойСсылкиНаСервере(УИД);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СтавкаНДС", СтавкаНДС);
	Если ОтборПоПериоду Тогда
		ПараметрыФормы.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт"));
		ПараметрыФормы.Вставить("ВидСравненияСтатуса", ВидСравненияКомпоновкиДанных.НеРавно);
		ДоступныеПериоды = Новый СписокЗначений();
		ДоступныеПериоды.Добавить(Дата(1,1,1));
		ДоступныеПериоды.Добавить(Период);
		ПараметрыФормы.Вставить("ДатаОкончанияДействия", ДоступныеПериоды);
		ПараметрыФормы.Вставить("ВидСравненияДаты", ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСправочникаДоговорыАренды(УИД)
	
	// ++ НЕ УТ
	СписокСсылок = СписокДоговоровАренды(УИД, Период);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ссылки", СписокСсылок);
	
	ОткрытьФорму("Справочник.ДоговорыАренды.Форма.ФормаСписка", ПараметрыФормы);
	// -- НЕ УТ
	
КонецПроцедуры

// ++ НЕ УТ
&НаСервереБезКонтекста
Функция СписокДоговоровАренды(УИД, Период)
	
	СтавкаНДС = ДанныеНоменклатураОбработкаНавигационнойСсылкиНаСервере(УИД);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",    Период);
	Запрос.УстановитьПараметр("СтавкаНДС", СтавкаНДС);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УсловияДоговоровАрендыСрезПоследних.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.УсловияДоговоровАренды.СрезПоследних(&Период, ) КАК УсловияДоговоровАрендыСрезПоследних
	|ГДЕ
	|	УсловияДоговоровАрендыСрезПоследних.СтавкаНДС = &СтавкаНДС
	|	И УсловияДоговоровАрендыСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДоговоровКонтрагентов.Закрыт)";
	
	Результат = Запрос.Выполнить().Выбрать();
	Ссылки = Новый СписокЗначений();
	
	Пока Результат.Следующий() Цикл
		Ссылки.Добавить(Результат.Договор);
	КонецЦикла;
		
	Возврат Ссылки;
	
КонецФункции
// -- НЕ УТ

&НаСервере
Функция НачатьЗаменуСтавкиНаСервере(СписокСправочников)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ПараметрыПолученияДанных = Обработки.ЗаменаСтавокНДС.ПараметрыПолученияДанных();
	ПараметрыПолученияДанных.ТекущаяСтавка      = ТекущаяСтавка;
	ПараметрыПолученияДанных.НоваяСтавка        = НоваяСтавка;
	ПараметрыПолученияДанных.Период             = Период;
	ПараметрыПолученияДанных.Страна             = СтранаРегистрации;
	ПараметрыПолученияДанных.СписокСправочников = СписокСправочников;
	
	ИмяФункции = "УчетНДСУП.ЗаменитьСтавкуНДС";
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		ИмяФункции, ПараметрыПолученияДанных);
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеФормы(ПроверятьПериод)
	
	ОчиститьСообщения();
	
	ФормаЗаполнена = Истина;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтавка) Тогда
		ФормаЗаполнена = Ложь;
		ТекстОшибки = НСтр("ru = 'Поле ""Ставка"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,, "ТекущаяСтавка");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоваяСтавка) Тогда
		ФормаЗаполнена = Ложь;
		ТекстОшибки = НСтр("ru = 'Поле ""Новая ставка"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,, "НоваяСтавка");
	КонецЕсли;
	
	Если ПроверятьПериод И Не ЗначениеЗаполнено(Период) Тогда
		ФормаЗаполнена = Ложь;
		ТекстОшибки = НСтр("ru = 'Поле ""Период"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,, "Период");

	КонецЕсли;
	
	Возврат ФормаЗаполнена;
	
КонецФункции

#КонецОбласти
